<?php

return [
    /*
    |--------------------------------------------------------------------------
    | Конфигурация сервиса Kaspi
    |--------------------------------------------------------------------------
    |
    | Параметры конфигурации для API Kaspi.
    |
    */
    'api' => [
        'kaspi_api_url' => "https://kaspi.kz/shop/api/v2/", // Ссылка на официальное API Kaspi
        'kaspi_mc_api_url' => "https://kaspi.kz/mc/api/", // Ссылка на неофициальное API Kaspi

        'max_attempts' => 3, // Максимальное количество попыток
        'retry_timeout' => 20, // Время таймаута между попытками в секундах
        'debug' => false, // Флаг отладки для Guzzle
    ],


];
